CSI API ETABS v1
cDesignConcreteSlab.StartSlabDesign Method
 Starts the concrete slab design.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int StartSlabDesign()
Function StartSlabDesign As Integer
Dim instance As cDesignConcreteSlab
Dim returnValue As Integer
returnValue = instance.StartSlabDesign()
int StartSlabDesign()
abstract StartSlabDesign : unit -> int
Return Value
Type: Int32
 Returns zero if the concrete slab design is successfully started; otherwise it returns a nonzero value.
Remarks
 This function designs slab strips, individual finite elements, and checks for punching shear, if concrete slabs are present. The function will fail if analysis results are not available.
See Also
Reference
cDesignConcreteSlab Interface
ETABSv1 Namespace